person
horse
jumps
broken
airplaneA
training
competition
diner
ordering
omelette
outdoors
neutralChildren
smiling
waving
cameraThey
parents
entailmentChildren
cameraThere
children
present
contradictionChildren
cameraThe
kids
frowning
boy
jumping
skateboard
middle
red
bridgeThe
skates
sidewalk
skateboarding
trick
wearing
safety
equipment
neutralAn
older
man
sits
orange
juice
small
table
coffee
shop
employees
bright
colored
shirts
smile
backgroundAn
drinks
waits
daughter
get
work
contradictionAn
backgroundA
flips
burger
elderly
neutralTwo
blond
women
hugging
one
anotherSome
vacation
contradictionTwo
anotherThe
sleeping
entailmentTwo
anotherThere
showing
affection
people
restaurant
setting
drinking
juiceThe
eating
omelettes
sitting
desks
school
diners
entailmentAn
restaurantA
restaurantTwo
wine
waiting
meal
arrive
blondhair
brown
shirt
public
water
fountainA
getting
drink
fountain
park
reading
book
bench
lunch
saying
goodbyeThe
friends
scowl
full
dinner
two
woman
picture
met
first
time
years
great
catching
holding
food
carryout
containers
hugThe
sisters
saw
across
crowded
shared
hug
clutching
doggie
bags
hugTwo
groups
rival
gang
members
flipped
Little
League
team
tries
catch
runner
sliding
base
afternoon
gameA
trying
score
games
winning
tag
playing
baseball
Saturn
contradictionThe
special
event
order
show
american
culture
cultures
dealt
partiesA
hosts
basketball
game
neutralThe
high
hosting
entailmentThe
contradictionHigh
fashion
ladies
wait
outside
tram
beside
crowd
cityThe
care
clothes
wear
entailmentHigh
cityWomen
neutralHigh
enjoy
good
sense
child
enjoying
beachA
mom
dad
summer
beach
family
three
mall
shopping
neutralPeople
train
offThe
entailmentPeople
offThere
couple
little
young
frisbee
watch
girl
play
tide
sonThe
cross
street
front
pizza
gyro
restaurantThe
standing
still
curb
restaurants
walk
walking
together
green
jacket
hood
head
looking
towards
valleyThe
nake
cold
neutralWoman
white
foreground
slightly
behind
sign
Johns
Pizza
Gyro
backgroundThe
caucasian
contradictionWoman
backgroundThey
protesting
capital
entailmentWoman
advertising
black
city
working
backgroundOlympic
swimming
friend
arms
adults
female
shades
male
gray
away
eatery
blurred
image
dark
shirted
foregroundThe
related
foregroundTwo
run
chasing
home
tasty
steak
ride
bicycles
tunnel
road
near
convicted
prisoner
dressed
foregroundSome
board
foregroundThere
walks
next
briefcaseA
married
banana
following
eats
trailing
briefcaseThe
coworkers
ice
cream
another
purse
mans
briefcase
hungry
briefcaseAn
actress
favorite
assistant
talk
briefcasea
crosses
briefcasethe
seductress
cafe
skier
slides
along
metal
railA
rail
skis
nightThe
car
skiis
nightThey
fantastic
skiiers
electric
edge
ramp
made
barsThe
brightly
slid
race
course
jogger
ran
streets
yellow
uniformed
performing
railed
objectA
snowboarder
riding
ski
lift
competing
engaging
winter
sports
fountainThe
thirsty
contradictionWet
dog
swims
bed
neutralWet
cameraA
fetch
pond
entailmentWet
contradictionCloseup
swimmingA
cat
reluctantly
takes
bath
neutralCloseup
swimmingAn
underwater
camera
photo
puppy
entailmentCloseup
body
furry
oceanA
fish
running
around
yard
big
stick
photographer
taking
pictures
hat
pitchfork
directs
horsedrawn
cartThe
farmer
driving
cart
directing
blue
dress
hitching
leading
Clydesdale
hay
within
Old
CountryA
country
business
suit
tea
straw
overalls
fertilizing
garden
manure
wagonThe
wagon
open
field
pulling
stands
watchesA
hauling
goods
watchesAn
animal
watching
group
churchgoers
choir
practiceA
watches
practice
performs
packed
practiceThe
pastor
elders
make
sure
drops
disc
beacha
ball
top
hillA
atop
hill
hillTwo
men
cafeAn
apple
bar
gentleman
new
old
beverage
hands
streetTwo
hold
streetThere
side
streetPeople
brick
townPeople
townA
going
schoolThe
library
contradictionPeople
listening
Catholic
churchPeople
band
singing
mass
communion
contradictionBicyclists
intersectionA
bicyclist
entailmentBicyclists
intersectionThe
bicyclists
neutralBicyclists
intersectionBicyclists
pass
bike
light
stop
traffic
intersection
bikes
turn
freeway
dead
store
remain
bikesA
bunch
boat
bikesPeople
bikesThere
bikesThe
inside
gym
biking
bikesMen
corner
ladybug
landed
beautiful
pink
rose
motorcycles
helmets
protective
jackets
skateboards
intersectionPeople
intersectionThere
happening
right
conversation
convenience
intersectionSome
stopped
junction
foot
movie
begin
bicycle
obeying
laws
mountain
speed
attached
filled
topThe
empty
topA
giving
piggyback
items
produce
vendor
watched
health
department
worker
topSomeone
someone
else
observes
merchant
determine
many
products
coal
octopus
groceries
shaped
like
womanA
sculptor
looks
girlfriend
lemonade
glass
neutralthree
bikers
town
entailmentthree
townBikers
towns
witnessed
arrival
slowing
townThe
Harleys
contradictionthree
townThree
mph
breathe
gas
pack
townThere
angry
rest
didnt
loading
brush
trailer
truckA
carrying
canoe
onto
truck
truckTwo
go
camping
burn
beard
sleeves
gloves
ropea
bearded
pulls
rope
ropeA
ropeThe
job
move
teeth
competes
contest
pull
lake
clean
shaven
dragging
sled
swimsuit
swings
able
grow
facial
hair
tugging
piece
naked
middleaged
oriental
headscarf
flashing
giant
smileThe
aged
smileA
happy
Asian
widely
rows
found
money
ground
lady
rowing
securing
lineA
something
lineThe
ocean
works
hard
establish
line
necklace
pool
fat
diving
contradictiona
skateboarder
poolA
skate
entailmenta
skater
neutrala
grinds
lip
appear
Indian
Pakistani
path
mother
diaper
father
wrapped
blanket
logo
humanitarian
organization
Save
ChildrenA
UNICEF
seeking
refuge
entailmentThere
baby
save
bagA
add
neutralThere
hoding
son
contradictionThere
airplane
signThree
pictured
signA
writing
foreign
dirt
waterthey
waterPeople
waterA
foreigner
cousins
hike
trail
stream
waterThe
admiring
foreigners
fall
locals
frozen
plays
waterThere
forest
sculptures
talking
sculpturesPeople
museum
sculpturesThere
sculpturesA
happily
painting
fair
sculpturesThe
recent
creation
single
sculpture
scultures
famous
artist
nearby
neutralGroup
dresses
strolling
sidewalkall
well
contradictionGroup
girls
prize
entailmentGroup
sidewalkthere
females
striped
jeans
steps
hunched
photographs
hima
photographing
scooter
alone
hawks
manager
tony
hawk
squatting
photograph
kick
flip
midair
short
flight
stairs
outdoorsA
taken
aliens
capture
tricks
abandoned
building
boyfriend
wedding
photos
Tony
Hawk
outdoorsPeople
take
exciting
pro
outdoorsTwo
slide
perfect
magazine
professional
photographers
contradictionOne
biker
themThe
cars
neutralOne
part
club
entailmentOne
themPeople
back
ridingTwo
cones
photographedA
roller
blades
photographed
helmetless
bouquet
flowers
seriously
gentlemen
stepsA
propose
serious
face
guys
stepsThree
indoors
proudly
streetThe
theatre
gay
pride
parade
streetA
neutralFour
teenage
boys
cannonballs
poolFour
see
throws
entailmentFour
splashing
lot
contradictionFour
poolSome
neutralThree
grass
tableThe
entailmentThree
contradictionThree
Foosball
outdoor
grill
basket
handsA
cookout
easter
eggs
church
Land
Rover
makes
way
deep
pondA
gets
stuck
drives
entailmentmany
relax
yardA
neutralmany
enjoys
sunny
day
backyard
contradictionmany
yardPeople
tv
living
room
sinking
flooding
crashed
large
sunshine
guitar
concertA
piano
wild
rocks
center
stageThe
bald
played
drums
stageA
guy
stage
stageOne
crazy
neutralwoman
trolley
labeled
Powell
market
bay
taylorThe
entailmentwoman
contradictionwoman
subway
medical
professionals
african
paperwork
hospitalCoworkers
monthly
meeting
left
hospitalThere
studying
final
exam
distance
past
wall
painted
words
graffitiA
defaced
reads
graffiti
railing
trolleyThe
anything
san
Francisco
polo
pointing
smilingThe
seems
jump
audiencea
bmx
triple
backflip
skating
grayhaired
coat
snowflakes
balances
headThe
loves
blonde
guarding
snow
fieldA
brother
sister
chase
fieldKids
fieldTwo
banjo
trees
outsideA
runs
sofa
colorful
outfits
rock
middleTwo
nonurban
environmentSome
environmentTwo
parked
hats
rocky
fieldThe
dancing
pantsThe
bedroom
entailmentMan
gold
pants
cameraMan
neutralMan
contradictionMan
hall
skirt
computerA
computer
screen
golf
typing
online
television
tshirt
deskthe
called
zoo
project
desk
rain
buying
laptop
foils
raised
facea
webcam
covering
sticking
tongue
bowl
headA
toddler
dumped
spaghetti
cereal
dances
fire
baton
nightthe
cheers
peforms
hula
dance
doctor
checks
stomach
toddlerThe
checkup
toddlers
mouth
toddle
might
sick
neutralYoung
putting
evening
gown
shoes
dipping
Buckingham
Fountain
Chicago
contradictionYoung
chair
entailmentYoung
air
capri
crouches
kicked
touch
falling
eager
balancing
toe
stand
dips
toes
grassy
waterAn
sticks
strolls
arm
hand
sidewalkThe
stare
passing
blockA
stares
blockThe
jealous
argue
block
backs
shouldercouple
sidewalkA
fighting
lap
overlooking
others
build
sand
castles
entailmentNew
sport
appreciation
walkPeople
honor
crippled
contradictionNew
football
without
gear
neutralNew
help
fund
wheelchairs
reaching
basketballTwo
sad
wheelchair
players
uniforms
attempting
reach
descending
backgroundSome
match
backgroundThree
peoples
court
grab
midairFour
cards
midairThe
four
handicapped
dogs
different
biting
licking
otherthe
otherthere
playfully
bite
third
outTwo
puppies
outA
pair
tease
nibbles
grassThe
grassThey
grassThree
fielddogs
bitting
attacking
fielddog
filed
contradictionTourists
art
neutralTourists
stopA
tourist
entailmentTourists
station
scrubs
operation
assisted
womana
womanthe
posterA
leaving
cleaning
elf
umbrella
menA
wig
contradictionIndian
sunlightA
pickle
entailmentIndian
sunlightTwo
neutralIndian
talkingTwo
talkingMen
exchanging
ideas
talkingA
slope
areaThey
fast
areaA
arent
learn
areaThe
hole
rides
areaTheres
wooded
area
using
avoiding
desert
volcano
bobsled
coats
lawn
covered
itThe
discussing
weather
itTwo
raincoats
cookies
backgroundThere
groundTwo
preparing
snowball
fight
groundPeople
groundMen
making
angels
outsideThese
never
wore
outsideThey
outsideIt
went
anyway
purple
scarf
accordionA
brushing
accordian
hundreds
dollars
neutralBMX
easy
entailmentBMX
ravine
contradictionBMX
tied
signthe
leaning
postA
reparied
flat
tire
ridden
locked
cycle
awayA
chained
daytimeA
daytime
world
warm
cityPeople
asleep
busy
New
York
CityThe
Kansas
view
buildings
Times
Square
CityThere
poppies
perfectly
City
bustling
noise
activity
clay
potA
flower
pot
potAn
sculpting
barber
customersA
customersThe
closing
end
shopThere
individual
shopA
haircut
glaze
bowlA
apron
inspects
cups
bowls
pots
baskets
assorted
sizeA
washing
dishes
size
model
posing
look
shes
real
soccer
playerA
modeling
cooking
shoot
entailmentFiremen
emerge
contradictionFiremen
stationThe
neutralFiremen
firemen
entailmentExhausted
neutralExhausted
contradictionExhausted
burning
firefighters
nearest
firefighter
helmet
handThree
axes
handThe
gathered
crewThe
directed
crew
jogged
alongside
walked
underwaterA
floats
driver
racing
Ford
vehicle
gravel
trackA
driven
track
togetherThe
climbing
plastic
dinosaurThe
toy
waterproof
Lone
Ranger
holds
handA
ring
shire
hate
bucking
rodeoA
rodeo
clown
chases
bull
bucked
saddle
bronc
rider
lifted
keeps
grip
rideThe
motorcycle
strange
machine
coconuts
sideA
coconut
milk
couch
rice
shucking
corn
shucker
surrounded
treesThe
boiling
treesThere
processing
vegetables
treesA
pile
Chinese
operating
sort
stainless
steel
appears
parkThe
jewelry
trapped
sews
cartA
bandana
mexican
shorts
jogging
iPodThe
headphones
entailmentWomen
exercising
mat
outfit
onThe
contradictionWomen
dressing
neutralWomen
yoga
neutralStudents
practicing
class
settingThe
students
contradictionStudents
solve
equations
entailmentStudents
settingA
progress
stretching
matsThey
stretched
mats
matsThe
yogaThe
sleep
contradictionMotorcyclist
watchTwo
strollers
entailmentMotorcyclist
watchMen
motorcyclist
neutralMotorcyclist
annual
tree
sidewalkThere
bustop
pose
cameraPeople
cameraTwo
yelling
laying
checking
star
hotel
homeless
leaping
airThe
nap
row
legs
boots
rowA
sandwich
feet
lies
mostlybarren
patch
congregate
distanceA
distanceThe
tired
beer
pub
contradictionVarious
hanging
buildingThe
neutralVarious
break
entailmentVarious
buildingThere
follows
umbrellas
pathThe
floor
packing
suitcaseThe
trip
unpacking
entailmentLittle
plaid
trailA
contradictionLittle
hiking
neutralLittle
downhill
backpacks
storm
hits
searching
supplies
suitcaseA
things
suitcase
brunette
boarding
plane
neutralStacks
neatly
folded
clothing
cover
beige
busily
fills
contradictionStacks
clubs
entailmentStacks
filling
packs
belongings
trash
bag
box
luggage
carrier
long
mountainsThe
mountains
resting
costume
marching
drumThe
drum
drive
bus
load
fresh
direct
boxes
wheels
himSomeone
toting
packages
urban
himA
lad
delivers
seniors
nose
wheelieA
wheelie
curbA
fix
relaxing
stopping
smokeThe
lighting
cigarette
Sunday
smokes
scooterA
scooterThe
smoking
motorcycleA
motorcycleMan
burgundy
danceThe
danced
vests
stripe
bottom
await
beginning
racePeople
charity
racethe
runners
waited
start
olympic
ready
pistol
signifies
cook
win
raceThe
athlete
backflips
started
backwards
Hell
carpeted
Toy
Story
loud
background
jumpsuit
railThe
held
JP
Morgan
Chase
security
guards
weapons
costumesThe
moving
costumesTwo
english
pulled
wagonThere
sun
sets
backgroundOld
backgroundChildren
backgroundGirls
manicured
duskPeople
teams
skilled
championship
fieldThere
entailmentSoccer
contradictionSoccer
hockey
rink
neutralSoccer
contradictiontwo
serving
foodTwo
neutraltwo
aprons
entailmenttwo
occurring
sunseta
sunsetthe
cup
sunrise
contradictionWhite
hoodie
parkA
video
entailmentWhite
neutralWhite
ropes
parkThere
likes
color
neutralToddler
sweatshirt
playgroundA
contradictionToddler
napping
entailmentToddler
playground
openThe
wondering
grocery
upA
amusement
themselvesThere
themselvesThe
amusment
parks
Walmart
checkout
bagged
employeeThe
bought
unhealthy
Target
employeeA
contradictionBrown
treads
waterBrown
entailmentBrown
soaked
neutralBrown
shore
checked
WalmartA
counter
check
registerA
walmart
laundromat
monkey
appliances
paddles
makeshift
boatA
boating
player
throw
baseballA
throwing
swinging
hit
zips
shorelineA
owner
fuzzy
birds
snuggle
blankets
pebble
seagull
dock
ballPlayer
winding
ballThe
tossed
neutralCheerleaders
cheeringThe
cheerleaders
contradictionCheerleaders
cheeringAn
entailmentCheerleaders
cheeringSome
cheering
cheeringCheerleaders
killed
cheerleader
bullet
Dallas
Cowboys
cheeringThere
cheer
cheeringPeople
sit
snowcovered
boomboxA
boombox
smiles
cellphone
arena
excited
human
tall
sideNobody
kneeling
shirtA
close
priest
shirtThe
jacks
silhouette
wallThe
gestures
anotherA
communicating
language
pockets
anotherTwo
spotted
splashes
waterthe
kitchen
waves
onlookersA
gesticulates
onlookersThey
raising
strand
beadsThe
beads
multicolored
performingpeople
onstage
marathon
point
forwards
kind
actA
tigers
somewhere
speaking
contradictionSeveral
neutralSeveral
entailmentSeveral
dancingpeople
religious
ritual
mating
adult
hot
tubA
TV
tub
average
guitarThe
knows
tan
waterthree
opposite
sides
newlywed
skip
seated
deskA
searches
internet
filming
formal
parkSomeone
parkEveryone
microphone
entailmentman
chess
aloneA
contradictionman
aloneThe
snooze
neutralman
try
herwomen
life
chessboard
laid
wooden
himTwo
Scrabble
chessTwo
chessThe
chessA
blazer
set
opponent
grandma
connect
rotary
arriveA
Mars
graffitied
sprayed
cans
paint
passes
drunk
alley
urine
airlifted
dangerThe
helicopter
danger
moved
dangerous
paying
attention
speaker
music
CD
boss
conference
tableyoung
party
fun
learning
politics
herthe
talks
notepads
office
windowsA
windowsa
notes
notepad
ducks
windowsthe
windowsThe
classroom
lectureThe
PE
lectureA
topics
lecture
history
clipboard
pen
themA
possessions
pinks
attentionA
wants
womans
shows
clipboardA
clipboardThe
tell
clipboardTwo
teaching
concept
electronic
tablet
writting
shadesA
funny
shadesThe
turned
resteraunt
stealing
cell
phone
shown
directions
shadesThere
faceThe
spilled
barefoot
backgroundTwo
sandles
darts
entailmentSmall
laughing
sippy
cupThe
neutralSmall
cupA
contradictionSmall
tantrum
tablethe
kid
mice
preteen
headphonesThe
cd
dogsled
dogsA
mouthA
mess
mouthToddler
threw
spills
mouthThe
corners
icecream
groomed
drank
unable
properly
sleds
snowThe
sledding
Alaska
cowboy
Roping
calf
roping
contradictionMen
concrete
slabMen
tents
entailmentMen
neutralMen
fishing
trout
screaming
airA
ruckus
relaxed
sidewalkone
sidewalkFour
chalk
sidewalkPeople
desolate
sidewalkEveryone
rests
lie
carpet
blocksTwo
pillow
lay
blocks
campus
greenThey
fried
tomorrow
greenThere
entailmentAsian
contradictionAsian
shouldersAsian
factory
workers
neutralAsian
schoolchildren
sweater
bumper
slow
breaker
workthere
workpeople
frolicking
us
capitol
buildingA
picnic
hitting
instrument
goldfish
mashed
potatoes
receive
sounds
terrible
multicolor
streetthe
nails
done
raise
drugs
neutralStreet
performer
song
contradictionStreet
entailmentStreet
guitarA
earn
extra
cellphoneA
ever
comes
unpainted
dilapidated
supervisor
calls
report
scaffolding
storefront
phoneTwo
phoneThree
phoneNo
excavator
digging
cementthe
cementa
alll
khaki
creekA
creek
jean
flies
kite
helping
find
loads
headsTwo
horses
nuts
heads
Asia
bring
attract
costumers
salesman
selling
patrons
cellphoneThe
knitting
texting
leavesA
leavesTwo
leavesThe
sneakers
stool
round
phoneThe
text
message
faceA
embarrassed
took
faceLady
gazing
faceYoung
private
print
faceAn
expression
staring
honeymoon
pictureThe
pictureTHe
cellphonea
call
log
window
sidesA
sleeveless
sidesThe
sidesHe
sobriety
test
tricolored
folding
laundry
pretending
bikinis
graciously
outstretchedA
outstretchedThe
outstretched
wide
grandmother
outsideThe
apartment
jungle
spreads
wideA
crossed
chest
Fall
lots
medals
bikini
military
officer
decorated
sees
scantily
clad
mid
twenties
kicking
leaf
paved
asphalt
plants
backgroundtwo
backgrounda
punk
kicks
leaves
backgroundsomeone
laughs
angered
joke
crying
losing
chanting
backgroundSeveral
brilliant
deserted
contradictionHispanic
sewing
article
clothingWoman
nothing
thumb
neutralHispanic
entailmentHispanic
streetNobody
streetHumans
streetTall
humans
pay
callEveryone
callSomeone
callThe
receiver
neutralSome
ropeSome
contradictionSome
books
entailmentSome
ropeChildren
golden
sniffing
butt
dogTwo
dogA
mutts
exchange
greeting
animals
know
sumo
wrestler
belt
pushing
boutTwo
kickboxers
excersise
doesnt
wrestlers
compete
greet
owners
watchthe
silver
necklaces
leather
bra
fingerless
sunglassesA
impress
sunglasses
smilingA
lottery
sweaterA
tank
gatheringA
bathing
gathering
buddies
crowdThe
anyone
needs
crowdA
offcameraA
maroon
climber
snowy
mountainsideA
ascending
camp
snowgear
leap
ravineA
chocolate
skiing
Colorado
lone
garment
framed
railingA
fencing
wife
snowThere
snowboarding
courtTwo
courtThe
riverbankA
lullaby
soccera
soccerpeople
goalies
avoid
progess
shotongoal
action
uniformsa
decisive
moment
penalty
knocked
toward
goal
tried
entailmentSix
uniform
contradictionSix
neutralSix
American
spangled
wagonTwo
mix
batch
margaritas
quilted
vest
displays
assortment
pendants
neck
byThere
bySomeone
browsing
byThe
chains
entailmentGirl
blowing
butterflyThe
blows
butterfly
contradictionGirl
sneezes
neutralGirl
kisses
downA
downThe
grandparents
approached
asked
okay
among
watermelonsThere
watermelon
thinking
purchasing
juke
sleeps
tableAn
dude
tableTwo
cats
sing
karoake
stoops
pick
farmers
planting
seeds
spring
bends
watermelonsThe
age
picking
pileA
item
flowery
fruit
citrus
screamingA
scared
whispering
fieldChildren
reward
fieldAdults
Frisbee
dogThe
scene
lights
behindPeople
behindThe
fields
sights
Toronto
tourists
behindCity
behindA
behindThere
lit
night
behindSome
behindIt
portrait
includes
itA
drawing
landscape
viewThe
sell
bathroom
dominated
Seiko
Years
Eve
buildingIt
buildingNobody
crowds
indoor
meet
buildingthere
nobody
china
rush
hour
America
gotten
cabinet
flour
crisco
himselfThe
violin
sky
self
contradictionBusy
Japanese
maybe
TokyoThere
neutralBusy
slowly
entailmentBusy
entailmentCars
neutralCars
townCars
contradictionCars
welcoming
travelers
streetIt
france
entailmentOverlooking
shops
states
Welcome
To
GoldenThe
says
Golden
contradictionOverlooking
neutralOverlooking
sigh
displaying
showroom
main
overhead
welcome
GoldenA
neon
Girl
wood
floorA
stuntTwo
socks
strewn
balloonsA
balloonsThe
celebrating
balloons
contradictionChild
strings
confetti
entailmentChild
neutralChild
goodlooking
Do
Not
Cross
tape
cityA
fireman
protects
boundary
watchA
keep
safe
brushfire
houseThe
houseA
twerking
statue
statues
busts
visible
ancient
stairsAn
stairsA
van
fenceA
pickup
teacher
childrenA
pets
alleyway
fenceThe
dining
fence
floral
vanA
signing
paperThe
names
bridge
intimate
statueA
plans
Tour
De
Force
bicycleA
sandals
hopscotch
numbersA
wears
numbers
grown
soccerman
contradictionMothers
gatheringThe
mothers
neutralMothers
gatheringThey
thier
entailmentMothers
conversations
lapsThe
house
lapsSome
babysitting
embracing
daughters
playdate
least
otherThe
otherWomen
blackandwhite
carries
clear
object
Dalmatian
bathtub
pirate
princess
sidewalkPirate
peach
cosplayer
hokey
pokey
fetching
porch
fetches
costumesKids
closely
pumpkin
bucket
treating
sidewalkBoy
followed
sidewalkTwo
costumes
trickortreating
Halloween
infant
handsThe
togetherTwo
exercise
live
healthy
slapped
Girls
sunshadepeople
barbecue
nintendo
plates
ricePeople
eat
soup
eatThe
guests
feast
eatPeople
milling
concert
ledges
built
treesSome
got
chopping
neutralWorkers
plywoodWorkers
construction
zone
entailmentWorkers
contradictionWorkers
beams
middayWorkers
diligently
sandwiches
foodthe
finished
neutralBiker
trackHe
contradictionBiker
paddling
entailmentBiker
wheeled
racer
trackThe
sweatshirtA
undressed
cattle
herd
sends
bikeThe
bikeA
dirtbike
accelerating
bikeMan
bikeWoman
facing
directionThe
stared
everyone
blondhaired
swing
juiceA
woodland
clearingA
entailmentOutside
German
shepherd
chaseA
contradictionOutside
neutralOutside
squeaky
german
chasea
boyfriends
pet
creepily
interacting
theater
ita
string
approaches
thermometer
fetchA
funTwo
partying
benchA
benchSome
chatting
benchThere
benchThe
really
share
benchSix
benchPeople
threesome
canada
army
uniformMan
School
neutralSkydivers
formationThey
contradictionSkydivers
entailmentSkydivers
formationPeople
skydiving
cafeA
pocket
wallet
tip
waiter
waved
tableA
contradictionLady
chairA
entailmentLady
neutralLady
shaving
wheeler
capThe
arenaA
toys
signs
papers
writes
coatA
rights
mine
lawyer
lifeguard
saves
someones
companion
simply
scratches
groom
bride
waistThey
kiss
waistThe
waistA
microphoneA
reciting
poetry
microphoneSomeone
stones
coke
zero
lakegirl
watertwo
dudes
watera
husband
fieldPeople
bleachers
togetherUniformed
togetherMen
places
carrots
casseroleAn
puts
casserole
slices
feeding
sheepThe
sheperd
Scotland
grouped
tailgate
clothed
Three
blueThree
suits
carTwo
salesmen
carThree
breaking
neutralEmergency
personnel
carEmergency
entailmentEmergency
carPeople
contradictionEmergency
vehicleFirefighters
rescuing
frying
breaded
cast
iron
panThe
greasy
oceanfront
property
Arizona
panA
cooks
garb
cloth
hearA
nun
praying
native
attire
featuring
design
braided
ribbonsA
stylishly
preparation
streetAn
oddly
ruffles
pushes
stroller
weird
deliciousThe
colors
crayons
backpack
areaTwo
quacking
planning
rob
glasses
bit
wallThere
bricks
helped
create
seashore
crashing
master
beached
kayak
buildingMan
buildingSome
snowA
snowAn
place
entailmentBlack
contradictionBlack
neutralBlack
stickA
onlookers
pretty
hang
paintings
gallery
bikesthe
bikesNo
nude
creepy
hes
stalking
shrine
cafeteria
entailmentFive
neutralFive
childFive
contradictionFive
childThe
gentlemans
childA
hangs
fifth
missing
childSome
memebers
Eastern
humansThe
watchAn
poster
shopThe
agree
let
put
owns
sale
Iron
Man
comic
decorating
Arsenal
warmsup
fans
ups
teaming
waitsThe
broke
highway
looked
prepared
shouted
encouragement
plazaThe
plazaThis
Queen
Elizabeth
II
Revolutionary
War
plazaPeople
lounge
neutralIn
bowling
ahead
pins
must
knock
entailmentIn
contradictionIn
turkey
lane
tonight
airport
laneA
return
alleyA
league
discussion
restauranta
converse
hospital
argues
tentPeople
tentThe
gathers
tables
chairs
anotherPeople
anotherNo
rocksA
fireplace
turtle
entailmentthe
flotation
device
waterThree
neutralthe
contradictionthe
surfing
advance
goalie
shortsThe
shortsA
prevent
sideline
shortsThis
World
Cup
points
defending
shortsThere
opposing
battling
ballA
ballMen
jerseys
jerseysA
jerseysThe
violinThe
violinist
community
parkTourists
spending
heada
headsomeone
violinistsA
violinists
musicians
revolutionary
period
ringing
bellA
apparel
bell
rocksPeople
landscaping
cap
downa
puddle
historical
pepper
spray
protesters
handthe
civil
war
reenactment
underway
handman
consisting
scenic
ate
entire
childeren
backgroundKids
rockThree
rockA
fourth
buildingAn
downtown
Santa
read
chartsThe
charts
assess
patients
condition
badminton
smilingthe
smilinga
mixing
bowlTwo
stuff
junk
acting
lays
bellyThe
troup
actors
bellyA
acts
lying
groundA
groundThe
plantTwo
plant
used
mens
wont
dirty
laugh
kitchenTwo
engage
milkThe
morning
windsurfs
wetsuitA
windsurfing
surfer
begins
balance
flying
windsurfer
choppy
fell
wakeboards
competeing
wakeboarding
parasails
parasailed
calm
parasail
tiara
sings
chorus
sailor
hatsThe
woodworking
toolthe
woodworker
dayThe
dayThere
jetsThe
interested
jet
displaytwo
logA
logThe
grandpa
somthing
uses
float
river
learned
arches
waterTwo
expectant
lets
listen
herA
shares
pregnant
pregnancy
herSomeone
ear
belly
distanceSoccer
jacuzzi
distanceThere
ChinaTown
storeThe
France
storeThere
bubbles
dockA
Atlantic
planter
paintingsA
stony
littered
placesThe
pristine
patioboy
accross
patio
grassHe
sour
broadly
hates
mugs
truckfull
sacks
materialsThe
doctors
stocked
supply
Humanity
prepares
equipmentThe
equipmentThere
today
loaded
various
suppliesThree
joyously
marketplace
asian
countryA
Market
lonely
East
Africa
crowed
pasted
headed
buildingTHe
catches
wave
stays
boardThe
backyardThe
upwardA
gazes
skyward
contradictionGray
pavement
courtyardA
neutralGray
entailmentGray
backyardA
cocker
spaniel
yarn
pictureA
entailmentOlder
fountainAn
contradictionOlder
neutralOlder
fountainTwo
younger
balloonThe
balloon
gatheringthe
sat
fountainThere
fountainThey
picked
umbrellatwo
umbrellaa
rainy
skirtThe
hours
skirtA
friendly
attacks
awayTwo
awayThe
beagle
retriever
excitedly
also
cameraBoth
corgis
sandbox
greets
greeted
charges
Corgi
neutralKids
destroying
objectsKids
Legos
entailmentKids
contradictionKids
grenades
equipmentChildren
floorTwo
floorThree
menu
miscellaneous
itemsKids
tossing
robot
carpetThe
kennels
carpetTwo
bone
masters
bulldogs
floorthe
rolling
wrestling
otherTwo
otherA
couchThree
couchTwo
scuba
diver
emerging
dive
wrestleTwo
Construction
poking
interesting
shovelsThe
shovelsSome
tower
shovels
poke
intriguing
shovelssafety
fly
clouds
treasure
cool
shovelsThree
alive
artifacts
site
examining
shovelsTwo
examine
shovel
examines
colleagues
shovelsConstruction
deer
sweating
heels
parking
dig
poker
graves
shovelsMen
males
shovelsThere
sweat
nineteen
dull
shovelsPeople
benches
heavily
doors
openIt
mountainA
mountainPeople
mountainSome
mountainThree
mountainTwo
lean
better
summery
openTwo
openThey
wagonPeople
wagonA
say
goodbye
departing
relative
openA
jacked
dove
flowered
treeThe
nurse
doves
perched
treeWoman
cradling
flowering
birdThe
birdthe
professor
beats
breakfast
trumpet
birdA
bird
branch
nice
caged
fake
treeA
mouse
treeThere
treethe
returning
nest
shoveling
driveway
fallen
concerned
treea
ina
marshPeople
marsh
Louisiana
doveA
hunts
climbed
doveWoman
doveThe
sparrow
tends
injured
touching
fieldThree
bushes
mural
prominently
manA
president
mana
alien
overlord
king
neighborhood
entailmentThis
itThere
neutralThis
contradictionThis
bare
muralthere
muralShe
rollerblading
fifteen
horseThere
horseA
horseback
motorbike
communityTwo
superheroes
deck
fishingA
sea
pole
polesThe
pier
entailmentSomeone
contradictionSomeone
neutralSomeone
poles
belong
perosn
brige
bass
gather
partyYoung
celebrate
Fourth
July
partyMen
roof
accident
suprised
occupied
jumpingThe
guitarist
ends
calmly
fansThe
solo
worked
peanuts
fansA
audience
musical
request
unicycle
circus
instruments
phonea
phonepeople
soprano
saxophone
listener
phonethe
stadium
iphone
texts
phoneShe
smartphone
phoneGirl
recording
aquestrian
connected
escapes
captivity
kills
send
glue
sidewalkStreet
performers
skills
perform
sold
campfire
nightThere
frog
firePeople
thingsThe
camper
poured
thingsA
everything
hippo
retrieving
duck
campfireThe
burns
waterDog
swimminga
dries
swimmingThere
helps
computerThe
English
paper
butchers
leans
handles
strip
meatA
meatThe
butcher
customer
cut
meat
thinning
plantA
tough
plantThe
handling
cage
itWoman
petting
itFemale
chef
seasonings
fingers
extended
skyThere
seventeen
palm
passed
goes
swim
neutralpeople
handsPeople
entailmentpeople
answer
questions
contradictionpeople
rude
African
speaksA
enthusiasm
ladder
doodling
notebook
neutralRepairing
unfunny
beThe
shining
directly
repaired
contradictionRepairing
raining
entailmentRepairing
apply
stucco
repairing
siding
temporary
tattoos
Muslim
ladyChildren
decorations
canvas
festival
woodsA
babysitter
woods
woodsThe
tent
dolls
dry
Autumn
leavesAn
Timmy
chased
forestA
stadiumA
stadiumThe
loses
broadcasters
gameCommentators
rehearsing
rushing
commentators
sidelinesThree
neutralReporters
sporting
press
coach
entailmentReporters
contradictionReporters
signNo
attempt
blow
candles
multitiered
cake
candle
airThere
shot
burrito
airOne
birthday
touches
footA
erupts
walkingThe
blown
wind
walkingA
poses
recumbent
faces
pinkA
waterIt
snowing
floating
vessel
Jersey
Shore
cleft
hurt
treats
canoes
crystal
crisp
redheaded
double
ended
paddleThere
paddleThree
prepare
canoeing
paddleThe
paddleA
ship
sinks
multiple
youth
kayaks
paddle
several
rafts
raging
paddleboarding
outdoorsAn
falls
upturned
plate
bookThree
bible
bookPeople
bookWomen
monitors
postopA
patient
administering
injection
bookA
stuffed
gently
rubs
tummy
bookthe
rats
bat
catcher
umpire
squat
watchesThe
Pirates
Mets
glove
standsThe
standsFans
fill
seats
battle
pitch
standsA
batThe
batting
batOne
batSomeone
batA
athletic
batAn
docks
steam
ships
flowersA
skaters
cornerThe
dayTwo
wives
turning
trackFour
athletes
rinkPeople
rinkThe
eventThe
qualifying
participating
iceskating
raceSome
raceNo
strips
fieldSoccer
practices
neutralRunners
uphillRunners
uphill
checkpoint
entailmentRunners
contradictionRunners
uphillThe
lifting
pileThe
crate
stack
cratesA
stacking
crates
counting
stock
stacks
tidy
chicken
simple
crateA
lockersThe
lockersA
lockersTwo
lockers
fenceMen
fenceTwo
fenceConstruction
chickens
gardeners
doze
ears
bushTwo
lost
opening
utility
boxTwo
hammering
electricians
lime
chain
link
fenceSad
Men
fencePeople
fenceWomen
workTwo
vegetable
workPeople
manTwo
manFive
interrupts
cane
wallA
disabled
painful
backgroundPeople
backgroundOne
grounds
hostage
gun
chunk
demise
playingThe
playingThere
thrown
outsideTwo
glaring
outsideFour
grassTwo
grassanimals
grassIt
grassthe
canines
grassA
grasssome
grassOne
snowThree
snowman
tugowar
crochetThe
stood
crochet
ballsA
balls
squares
gameTwo
gameAn
roll
stay
entailmentElderly
bandThere
contradictionElderly
bandThe
neutralElderly
benefit
plying
harmonica
instrumentsPeople
instrumentsA
local
babies
fiddler
bandThree
planetarium
parkChildren
stageAn
projects
projectsThe
crayon
taught
algebra
lesson
dogthe
dogThere
outsideAn
neighbor
beret
process
information
regard
microscopea
seeing
bacteria
microscope
beauty
salon
scientist
discovery
code
notesThe
document
changes
chalkboard
notesA
accurate
account
appropriately
recordedEnsuring
pressed
accurately
recorded
kept
case
legal
issues
future
affectionately
passengers
tour
boatThere
boatThe
cruise
swimmingPeople
iced
digs
snowDog
somehting
buys
marketA
spends
lettuce
cutoff
failA
caught
womenWomen
womenA
womenTwo
womenThree
spaceship
asparagus
bagTwo
bagThe
cheese
butter
farm
entailmentBeautiful
striking
artistic
poseThe
neutralBeautiful
contradictionBeautiful
standThe
salad
hairA
banquet
dryer
longsleeved
tie
saxophonethe
modeled
tuxedo
auditioning
bandA
polishing
bestA
talent
bandmates
instrumentsSome
holiday
instrumentsThe
audienceA
quintet
festivalTwo
tentA
number
bluegrass
irritateda
heavy
slim
irritated
crash
ballTwo
boogie
boarder
surfs
waveThere
waveThe
receptionTwo
love
huge
complete
strangers
ones
receptionA
proximity
studyingA
studyingThe
college
referee
fieldplayers
topic
bottle
tableman
tabledog
hurrying
midairtwo
rugby
entailmentPlayers
tangle
pursuit
contradictionPlayers
ballOne
neutralPlayers
rivals
White
Team
struggling
writingThe
forgot
wrote
sidelines
minutes
smaller
behinda
bathroomA
traditional
paradeAsian
subject
alcoholic
beveragesThe
otherSome
asking
marry
whos
Boss
LifeThe
vandalized
burnt
due
arson
casual
barbecued
mealThe
sips
contradictionMany
blouse
drinkThe
entailmentMany
drinkPeople
neutralMany
ravishing
walkingThere
microphones
quietly
strumming
cannot
readily
seenThe
plucks
glittery
sparkle
although
blocked
nicely
even
blocking
balcony
Bull
runThe
sipped
candy
singingold
singingthe
death
beds
fenced
areaThere
whilst
eight
swimsuits
groundtwo
pathA
pit
desertThe
shrubs
grassThere
cameraman
tether
waterskis
every
directiona
watersking
squirrel
outsideThere
camerathe
cameraTHe
neutralGirls
thin
fabric
cameraAll
contradictionGirls
sweaters
entailmentGirls
cameraAt
cameraGirls
noticed
cameraa
cameratwo
puppys
lick
tears
contradictionDog
FrisbeeA
yawns
entailmentDog
neutralDog
clothsA
cloths
wash
goggles
crawl
poolNobody
petals
floorAn
draw
sticksThe
crappy
sandcastles
teenagers
tube
slideA
bars
swimmer
coming
drowning
bandanna
teeshirt
flag
swimmers
exits
competitionA
wet
peopleThe
barren
sunhats
shoreThree
shoreFour
sandy
girlsThe
sunset
coastSome
coast
smilesThe
Paris
thick
rolls
backThe
scratching
busThe
massive
Sharpie
markerA
markerThe
marker
markerThree
brushes
sharpie
markerAn
student
sketch
pencil
permanent
dinosaur
draws
lines
tile
carpenter
quick
utensil
strawberry
decorates
blackA
weaving
pattern
boardA
chevron
knits
procession
paradeA
leads
entailmentBarefooted
mirrorA
mirror
neutralBarefooted
contradictionBarefooted
pops
baseballThe
far
ballsomeone
trials
stunt
graffitifilled
cycling
bicyclesTwo
triathlon
hamburgers
curved
figures
feces
entailmentSeven
bridgeThere
contradictionSeven
neutralSeven
hoodies
wayThree
trunks
wayGroup
best
conversing
citythe
drove
countryside
phones
hooded
sweatshirts
cameraSome
loiter
cameraThree
knitted
hatThe
propped
cushionA
knit
propping
towerThere
towerThe
photoThe
pie
photoThree
Child
fancy
picturethe
scenery
binocularsA
tool
improve
binocularsThe
viewing
landThe
telescope
pilots
submarine
land
Lion
King
windowPeople
windowThere
Cinderella
performed
neutralPhotographer
sunsetWoman
contradictionPhotographer
sunsetPhotographer
entailmentPhotographer
swinga
rotten
amongst
cloudy
wrist
streetSome
escaping
lazy
bridgeTwo
bridgeA
woodThe
pouring
liquid
liquidthe
liquidthere
plaza
neutralMonks
robes
veggies
entailmentMonks
contradictionMonks
marketpeople
schoolA
tennis
hallway
potteryThe
pottery
climb
bridgetwo
overpassA
overpassTwo
escalating
visiting
state
climbs
cityTwo
steep
lounges
adjust
uncomfortable
swimA
sundae
teaches
learns
leg
oneA
shoeless
beerA
beera
casually
unwind
weeding
button
relaxes
beerThe
earth
moon
sip
backyardTheres
denim
boxer
briefs
ceramic
plain
dayA
cooped
shelter
hoping
adopt
want
kissA
french
dont
neighbors
contradictionFans
performanceThe
neutralFans
performance
entailmentFans
soldiers
silent
hoseThe
redhead
hose
armed
forces
officers
civilians
childrens
playgroundArmed
guns
trade
insults
neutralUS
troops
keeping
crucial
Tripoli
LibyaA
deploy
contradictionUS
entailmentUS
quiet
entailmentMilitary
playgroundthey
contradictionMilitary
mars
neutralMilitary
Mardi
Gras
accompanied
roadThe
roadA
brothers
rural
travel
creekSome
farmhouse
lakeboys
congregating
gossiping
observe
remote
control
waterFive
waterOne
controlling
leftThere
Asians
leftThe
contradictionBoy
punching
himNobody
fist
clenched
neutralBoy
himThe
entailmentBoy
poor
africa
bikeThree
turns
bicycleThe
backed
drummerA
drummer
backing
payer
captain
steering
wheelA
helm
wheelThe
pilot
testing
lightweight
aluminum
wheel
contradiction
NP
PRP
VP
VBZ
VBG
ROOT
DT
NN
tractor
neutral
PP
IN
entailment
nautical
smilingly
manned
wellequipped
wheelAn
shipThe
abandon
navigating
captains
uniformOlder
sailing
enraged
prank
callThree
shooting
themed
porno
couchThe
dreaming
hairy
pours
creamer
ripples
surfacea
surfacethe
camouflage
toolbox
backpackNobody
backpackA
directionsThe
directionsA
challenges
karate
instructor
directionsIt
neutralFemale
entertainer
horns
curtseyThe
contradictionFemale
entailmentFemale
swingA
swingLittle
bears
receptionPeople
worksThe
stallshops
dimlylit
cobblestone
vendors
stalls
bronco
competitionthe
rode
sheep
chinese
soupThe
noodle
jogsThe
jogs
jogsA
tablethree
eachother
plotting
assassination
deciding
decide
orders
delivery
restaurantPeople
Chines
somethingThe
poeple
contradictionPedestrians
streetpeople
entailmentPedestrians
neutralPedestrians
clasps
individuals
clasping
himThere
paradeThe
watchingThe
painter
ad
company
watchingPeople
paints
underneath
HiPointe
Las
Vegas
summit
nightclubThe
rescue
approaching
driverThe
earlier
armadillo
loveseatA
grandfather
grandson
second
saxophoneThree
garage
siteThree
siteA
booze
liquor
sipping
champagne
beam
rises
workThe
Ibeam
harness
workA
surface
almost
quit
opera
workThese
operate
hammers
workThere
shower
miners
extracting
ore
jackhammer
leak
platform
carry
skyscrapers
backgroundWorkers
windows
grand
hallA
trio
jazz
nightclub
chamber
matThe
physically
active
matTwo
arguing
neutralAdolescent
polkadotted
contradictionAdolescent
rapping
hip
hop
microphoneThe
entailmentAdolescent
microphonea
mic
waffles
microphoneYoung
rap
folk
madden
xbox
dot
symbols
rugged
mouthDogs
leash
polka
speech
karaoke
performancethe
loudly
natureA
mows
porchA
porchNobody
camerasome
cameraLadies
erect
barn
rocking
jacketThis
door
jacketA
doorA
doorIt
doorThe
dunking
support
Special
OlympicsSeveral
shaved
splash
waterAdults
orangeThe
solid
much
brightlycolored
shirtsThree
fountainMany
riverPeople
drillthe
brazilian
drill
contradictionsome
basketballSome
entailmentsome
neutralsome
basketballThe
softball
come
gymnasium
basketballThey
restaraunt
dumpsterA
ages
backgrounds
studioThey
studioThe
notebookThe
notebookA
brings
keyboard
singsA
skips
singer
rehearses
handAn
synthesizer
roomThe
racket
curtains
drawn
closed
aisle
bookBilly
clutched
booklet
alter
cleans
service
foldingchairsA
attendant
demonstrating
devicesA
seat
stewardess
reviews
procedures
planeThe
Taiwan
planeA
use
duty
vestA
otherAn
mean
models
deviceThe
floatation
walkingTwo
caucasians
tending
gardens
stroll
walkingLadies
Japan
walkingOne
corridor
wallTwo
smashing
courtyard
flute
acoustic
accordion
Louis
Vuitton
heel
Dior
musician
smashes
sisterTwo
sacrifice
Gods
motocross
descendA
descend
queue
carpetThree
routine
rappels
inclinea
cheetos
rappelling
waterfall
reached
summitA
girlTwo
girlA
bush
girlThree
somebody
haired
beat
cheerleading
girlPeople
hoisting
larger
shoulders
goofing
grassAn
skyA
dug
prances
outdoorsThe
poodle
rocksHe
aiming
target
rocksThe
bow
arrow
crouching
stone
rifleThe
sword
aims
rhino
hilltop
crouched
gunThe
gunA
revolver
girlsTwo
altitude
gunAn
mugA
mug
muga
mugThere
mugThe
highwayThe
bottleA
auto
pedestrian
trafficThe
card
Dasani
skit
parallel
trafficA
traffica
markersPeople
bullying
cruel
markersThere
silly
markers
kissing
beachthey
beachthere
caughtThe
speaks
microphoneThere
walkersGirl
walkers
walkersThe
walkersA
sneaking
trouble
aroundA
corded
aroundThere
auditions
frilly
camo
airportA
airportThe
descent
baggage
collect
Orient
join
symphony
orchestra
claim
flights
checkinA
nearly
misses
departure
late
tumbling
leafcovered
sundowna
thew
trucker
style
shirta
shirtthey
National
Bohemian
Beer
playersA
playersThe
blackshirt
aquarium
marine
lifeA
types
smirking
speakerTwo
speakerA
date
laundryA
nowhere
washedThe
washedA
five
machinesA
machinesThere
machines
designed
aquariumSome
aquariumPeople
aquariumA
observing
aquatic
aquariumThe
Eiffel
Tower
sharks
aquariumThere
exhibit
upon
turtles
visits
finish
dryingA
vestsThe
vestsPeople
swimmingThe
matching
tanning
seathe
sons
lakeThe
lakeA
zombie
makeupGirls
makeup
zombies
brides
hunting
elephant
Italians
songs
sharing
sweets
granddaughter
hatA
feeds
hatThere
gives
cape
selfish
crownA
goodies
princessWoman
lapThe
soda
daughterThe
cone
weighs
pounds
gliding
cricket
tournament
daughterA
starving
mealtime
delicious
skinny
daughterThere
spoon
souvenirs
photographThe
photothe
photoa
photographA
cellphonethe
christmas
saxaphoneA
barrels
roofthe
oil
AfricanAmerican
archways
tiled
docked
removed
tips
contradictionLocal
villagers
gorgeous
neutralLocal
hope
entailmentLocal
boatPeople
scrabble
rimmed
packageA
opens
redhair
silently
wallAn
ashes
foreheadthe
ash
forehead
bishop
talked
cheek
foreheada
rid
demon
robe
sash
manThe
graduating
meditating
beliefs
manThere
blessing
forehand
shaded
sandcastle
areaPeople
hillThe
peopel
hikeA
exploring
sightThe
People
sight
canyonPeople
canyon
joyrideThree
means
rideSome
rideA
type
ridePeople
rideThere
couples
carnival
rideHumans
rideNobody
rideTall
parkKids
parkPeople
parkAdults
parkSome
gocarts
gocart
downhillA
picks
pushed
swingset
motorscooter
sceneries
buggy
crowdPeople
crowdMany
basketballThere
physical
rowingthe
sunken
upPeople
casino
slots
direction
thing
brawl
raisedthere
amidst
peopleA
kibble
adorned
graffitiThe
figure
graffitiThere
contradictionHere
nt
taggedThe
neutralHere
entailmentHere
itPeople
neutralPitcher
mount
suite
pitchingA
contradictionPitcher
pitcher
entailmentPitcher
neutralBand
entailmentBand
contradictionBand
canceled
thousands
gazebo
listens
outsideSeveral
soft
snowTwo
snowballs
entailmentBruce
Springsteen
stageBruce
contradictionBruce
neutralBruce
stageThere
unknown
crowdThere
Volvo
dealership
conesA
conesThere
crime
conesThe
dealershipA
Honda
square
placed
signal
dealershipTwo
sales
illuminatedA
Christmas
pinklike
colorThe
flowerbed
weeds
stressful
week
fingernails
purpleA
pedicure
manicure
acrylics
colorA
finger
massage
spa
manicureSomeone
contradictionthere
six
neutralthere
entailmentthere
wading
waters
riverThe
riverThere
bites
waterAnimals
shallow
hind
ledgeA
rug
ledge
peering
contradictionDogs
creekThe
vet
entailmentDogs
creekThere
neutralDogs
slideThere
sent
mission
outer
space
slideThe
darkhaired
structureA
structure
terrier
bacon
banner
banners
needed
starting
caneA
antique
circle
symbol
rightHe
restroom
guiding
stonesTwo
beachThe
shade
beachSomeone
hides
beneath
towel
beachMan
Venus
Mojave
beachpeople
beachthe
letter
contradictionCraftsman
neutralCraftsman
entailmentCraftsman
ropeThere
crib
hooked
zipline
stepped
platformA
celebrates
ziplining
bungee
ziplineThe
ziplineThere
quickly
zip
helmetA
surfboard
bricksA
seed
clustered
alcoholA
contradictionGuys
cramped
handThere
entailmentGuys
neutralGuys
placeA
aerial
peopleThere
alligators
captured
logthe
advertisement
Google
beachSome
beachThree
leave
proclaiming
availableThe
available
sweaty
tattoo
collectionThe
skull
bones
shoulder
dish
kitchenA
contradictionTattooed
tattooA
tattooed
erased
neutralTattooed
character
entailmentTattooed
neutralShort
kitchenShort
employment
entailmentShort
contradictionShort
chief
pain
contents
bowelsA
timeA
policeman
pocketsA
policemen
handcuffing
suspect
pastry
chefs
senior
citizen
guard
carThe
suspicious
styled
prom
donkeyA
mowing
pairs
sunglassesa
crocheting
peers
waist
separating
homeA
stove
homeHe
homeThe
taller
yet
homea
household
householdA
kitchenThe
kitchenThere
punished
attends
fixed
tentIt
fixing
protection
rich
donations
canopy
onlooker
buy
popcorn
tentThere
laughsthe
eventA
swimwear
vegetated
lush
vegetation
oasis
mountainous
suitThe
laughingEveryone
laughingA
laughingSomeone
attending
located
tightly
mingle
mingling
gettogetherA
foolish
diverse
peopleTwo
teachers
bandtwo
underwear
fully
scrubbing
bucketA
injury
parkAn
crane
neutralConstruction
supportsSome
entailmentConstruction
contradictionConstruction
buildingTwo
appearance
scaffold
siteTwo
rooftop
torching
blowtorchA
grilling
streetside
mask
downTwo
propane
torch
steaksTwo
steaksA
steaks
darkskinned
dust
clothingtwo
dormitory
blowtorchThe
clue
dyed
dumpster
citySome
discs
often
referred
saucersThe
siblings
dives
lakea
twochild
rowboata
rowboat
headset
entranceTwo
exit
entrance
otherPeople
nodding
downAn
gate
toolboxA
workman
tampering
cassetteA
thief
hide
evidence
wrongdoing
records
messes
toolThe
toolThere
entailmentPerson
obscures
freshly
neutralPerson
hiding
contradictionPerson
clearly
shaking
himselfA
lab
shakes
himselfAn
labrador
drying
playpen
flaps
wings
waterDucks
flap
waterSomeone
scaring
mallard
flapping
Chung
May
Food
MarketA
transportation
transporation
storeA
ten
bicycling
travels
destination
markets
stores
mermaid
informational
feel
surroundings
cardsA
material
businessmen
expensive
plywood
spot
contradictionMale
stroke
neutralMale
entailmentMale
riverA
eyes
lakethe
entailmentAnd
duo
stagetwo
contradictionAnd
stagea
surgery
neutralAnd
hayThe
doll
otherwise
courtyardWomen
skies
puffy
cloudsA
dumptruck
entailmentOn
hanger
bagpipes
armA
neutralOn
contradictionOn
sortThe
funeral
sortHe
excitement
sortA
unique
monetary
gain
kiltThe
dirge
Scottish
horseshoesTwo
horseshoe
entertaining
paid
oceanPeople
celebratingThe
bodies
celebratingThey
partners
labTwo
copy
grey
spiral
bookletTwo
handbook
bookletA
notebookTwo
notebooks
laboratoryTwo
chemicals
protected
laboratory
bookThe
dissecting
chemistry
ballet
persons
highfive
dancers
ribbon
dancingFour
tango
dancingThere
dancingThe
stagepeople
popping
wheelieThe
popawheelyA
wrecking
wheely
scruffy
towing
comfortable
features
chairsThere
chairsAll
shadows
waterpeople
anotherOne
newspaperA
newspaper
section
leaningA
post
newspaperThe
reporter
browses
feature
stocks
buildingWoman
somethinga
installation
blind
skatesThe
rollerskating
rinkthe
rinkThree
rollerskatingSome
higha
cocks
gucci
javelinstyle
javelin
moonlight
bamboo
javelinA
demonstrate
technique
transforming
lived
name
informal
gameThere
gamePeople
smileyouth
signThe
itemsAn
newspapers
oceanThe
anchor
listenfour
listenThe
listenThere
listena
thru
listenA
perfomance
freebird
scout
stops
reed
clarinet
saxophones
clarinets
outdoorsSome
hammered
kit
saxophonists
clarinetist
taxis
overThree
overThe
speeding
contradictionLine
entailmentLine
passengersTaxis
neutralLine
cabs
lining
buses
customers
police
towed
intense
matchTwo
matchThere
opponents
soocerball
puck
soccor
fieldOne
huddled
countryPeople
billiards
grin
angle
headlessA
headless
low
existA
hanged
depressed
fairskinned
playgroundThere
playgroundThe
cow
recess
elementary
jockey
expert
tying
shoe
laceA
footwear
lacing
sportTwo
stretches
gogglesA
shirtless
bottoms
Speedos
gogglesThe
speedos
fit
seen
monumentpeople
monument
poolHe
rainbow
artA
completed
uniformstwo
launching
temple
netThe
equipmenta
Cricket
possibly
preschool
cryingThe
trickTwo
ollie
backgroundsome
backgroundthe
skateboarded
ollied
jumped
snowboard
expanse
concreteThe
concreteA
skateboardThe
businessThe
barreling
lawnThe
watchHumans
watchParents
boatThree
January
act
sauna
fishermen
boatTwo
staircase
booksA
downstairs
upstairs
booksa
knees
booksThe
booksThere
cluttered
librarya
librarythe
study
somethingThree
sprinkler
squirted
remains
pail
squirting
waterHe
lightcolored
muzzle
waterWater
prominent
buildingTall
buildingHumans
marriage
ceremony
picturePeople
function
picturesSomeone
picturesThe
picturesThey
tableFour
tablesThe
thingsa
level
boardroom
major
slam
dunk
net
watchMichael
Jordan
dunks
exhibition
clothesPeople
garbage
cleaned
reaches
watchesThere
laundromatTwo
supermarket
dropped
assesses
washer
assessing
laundromatThe
necktie
adding
bleach
laundromatA
clothesline
patron
cliff
skyscraper
daffodilsTwo
oceanMan
sands
oceanPerson
oceanWoman
oceanSad
jagged
bunk
redhaired
peaceful
lakeChildren
member
Red
Hat
Society
curly
headband
cameramanA
eyesa
campers
barrelPeople
barrelThe
entailmentCampers
lighter
fireThere
neutralCampers
contradictionCampers
bear
fireA
fireThey
corporate
retreat
applebees
cuddles
plastered
advertisementsA
advertisements
bigger
leashSome
leashTwo
leashA
nipping
bitten
bringing
contradictionFluffy
pebbles
shoreThe
entailmentFluffy
shoreA
canine
neutralFluffy
grassSomeone
SUV
neutralShadowy
talkingIt
contradictionShadowy
talkingThe
entailmentShadowy
talkingPeople
hoop
hooping
dried
bedWoman
drought
nightA
heading
phoneA
midday
barbers
doorway
trips
shoelace
notice
lotA
portfolio
reflection
mirrorThere
mirrorThe
mirrorthe
comedy
isnt
grabbing
breadThe
bread
breadA
pyramid
goallineCheerleaders
pyramids
grabs
outfitsThe
mascot
cheeleaders
smilingan
Lexmark
boxSmall
fortA
fort
discarded
fortress
jacketThe
hobby
clothingThe
clothingA
hails
taxi
onAn
onA
onPeople
attend
grassDog
barely
talkTwo
Tim
hortons
signThere
leaps
toyThe
baking
hovers
gallerys
digit
greyhound
bee
eightThe
seven
extremely
racetrackA
greyhounds
racetrackThe
rabbit
races
racetrackThere
petted
racetrack
racetrackAn
identification
runningA
autograph
marketplaceMan
daredevil
stuntA
stuntman
stunta
crashes
vaults
contradictionMotorcycle
reared
entailmentMotorcycle
neutralMotorcycle
motorcycleMotorcycle
sideways
motorcycleThe
straddling
motorcycleSomeone
saddled
motor
terminal
quite
motorcycleThere
wanted
worms
ridding
audienceThe
applauded
onlookersthe
onlookersa
stunts
handstandThe
containerA
pan
arrives
potluck
container
stew
musicA
autographedThe
proffered
diapers
Costco
author
stuccoed
RoyalTwo
dotted
gameOne
Twenty
viewers
watchThe
watchThere
settle
bet
entertain
including
pirateA
sax
entertains
Pirate
cries
eclectic
touristsA
touristsThe
improvising
neutralMusicians
entailmentMusicians
contradictionMusicians
billboardA
billboard
somewhat
entailmentMuzzled
trackDogs
neutralMuzzled
contradictionMuzzled
muddy
neutralRace
contradictionRace
circles
entailmentRace
spectators
judges
finishes
walkA
grinding
cozy
tux
cab
ripped
parka
parkthe
trainA
pointingA
commotion
mile
poleThe
afraid
parkTheres
neutralLots
entailmentLots
contradictionLots
streamersThe
streamersA
twirling
streamers
ribbonA
spinning
bodyA
spins
wand
aira
airborne
airborneA
treesSomeone
treesTwo
wintry
sceneThe
lodge
conditions
barefootA
midairA
parachuting
mostly
either
fightingtwo
fightingthe
roadTwo
pathTwo
oversize
checkers
